zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_adc.h
#define    ADC_CR1_JSTART_Pos                                     (2U)
#define    ADC_CR1_JSTART_Msk                                     (0x1U << ADC_CR1_JSTART_Pos)
#define    ADC_CR1_JSTART                                         ADC_CR1_JSTART_Msk

#define    ADC_CR1_RSTOP_Pos                                      (3U)
#define    ADC_CR1_RSTOP_Msk                                      (0x1U << ADC_CR1_RSTOP_Pos)
#define    ADC_CR1_RSTOP                                          ADC_CR1_RSTOP_Msk

#define    ADC_CR1_JSTOP_Pos                                      (4U)
#define    ADC_CR1_JSTOP_Msk                                      (0x1U << ADC_CR1_JSTOP_Pos)
#define    ADC_CR1_JSTOP                                          ADC_CR1_JSTOP_Msk

#define    ADC_CR2_RTRGCFG_Pos                                    (0U)
#define    ADC_CR2_RTRGCFG_Msk                                    (0x3U << ADC_CR2_RTRGCFG_Pos)
#define    ADC_CR2_RTRGCFG                                        ADC_CR2_RTRGCFG_Msk

#define    ADC_CR2_JTRGCFG_Pos                                    (2U)
#define    ADC_CR2_JTRGCFG_Msk                                    (0x3U << ADC_CR2_JTRGCFG_Pos)
#define    ADC_CR2_JTRGCFG                                        ADC_CR2_JTRGCFG_Msk

#define    ADC_CALR_CALEN_Pos                                     (0U)
#define    ADC_CALR_CALEN_Msk                                     (0x1U << ADC_CALR_CALEN_Pos)
#define    ADC_CALR_CALEN                                         ADC_CALR_CALEN_Msk

#define    ADC_CALR_CKDIG_DELAY_Pos                               (1U)
#define    ADC_CALR_CKDIG_DELAY_Msk                               (0x3U << ADC_CALR_CKDIG_DELAY_Pos)
#define    ADC_CALR_CKDIG_DELAY                                   ADC_CALR_CKDIG_DELAY_Msk

#define    ADC_CALR_CMP_MODE_Pos                                  (3U)
#define    ADC_CALR_CMP_MODE_Msk                                  (0x1U << ADC_CALR_CMP_MODE_Pos)
#define    ADC_CALR_CMP_MODE                                      ADC_CALR_CMP_MODE_Msk

#define    ADC_CALR_CMPRDY_DELAY_Pos                              (4U)
#define    ADC_CALR_CMPRDY_DELAY_Msk                              (0x3U << ADC_CALR_CMPRDY_DELAY_Pos)
#define    ADC_CALR_CMPRDY_DELAY                                  ADC_CALR_CMPRDY_DELAY_Msk

#define    ADC_CALR_VCM_MODE_Pos                                  (6U)
#define    ADC_CALR_VCM_MODE_Msk                                  (0x1U << ADC_CALR_VCM_MODE_Pos)
#define    ADC_CALR_VCM_MODE                                      ADC_CALR_VCM_MODE_Msk

#define    ADC_CALR_VCM_CTRL_Pos                                  (7U)
#define    ADC_CALR_VCM_CTRL_Msk                                  (0x1U << ADC_CALR_VCM_CTRL_Pos)
#define    ADC_CALR_VCM_CTRL                                      ADC_CALR_VCM_CTRL_Msk

#define    ADC_CALR_OFFL_EN_Pos                                   (12U)
#define    ADC_CALR_OFFL_EN_Msk                                   (0x1U << ADC_CALR_OFFL_EN_Pos)
#define    ADC_CALR_OFFL_EN                                       ADC_CALR_OFFL_EN_Msk

#define    ADC_CALR_OSCAL_CYCLE_Pos                               (16U)
#define    ADC_CALR_OSCAL_CYCLE_Msk                               (0xffU << ADC_CALR_OSCAL_CYCLE_Pos)
#define    ADC_CALR_OSCAL_CYCLE                                   ADC_CALR_OSCAL_CYCLE_Msk

#define    ADC_CFGR1_PEFSEL_Pos                                   (0U)
#define    ADC_CFGR1_PEFSEL_Msk                                   (0x1U << ADC_CFGR1_PEFSEL_Pos)
#define    ADC_CFGR1_PEFSEL                                       ADC_CFGR1_PEFSEL_Msk

#define    ADC_CFGR1_CLKSEL_Pos                                   (2U)
#define    ADC_CFGR1_CLKSEL_Msk                                   (0x1U << ADC_CFGR1_CLKSEL_Pos)
#define    ADC_CFGR1_CLKSEL                                       ADC_CFGR1_CLKSEL_Msk

#define    ADC_CFGR1_BITSEL_Pos                                   (3U)
#define    ADC_CFGR1_BITSEL_Msk                                   (0x3U << ADC_CFGR1_BITSEL_Pos)
#define    ADC_CFGR1_BITSEL                                       ADC_CFGR1_BITSEL_Msk

#define    ADC_CFGR1_APBCLK_PSC_Pos                               (6U)
#define    ADC_CFGR1_APBCLK_PSC_Msk                               (0x3U << ADC_CFGR1_APBCLK_PSC_Pos)
#define    ADC_CFGR1_APBCLK_PSC                                   ADC_CFGR1_APBCLK_PSC_Msk

#define    ADC_CFGR1_REFNSEL_Pos                                  (8U)
#define    ADC_CFGR1_REFNSEL_Msk                                  (0x1U << ADC_CFGR1_REFNSEL_Pos)
#define    ADC_CFGR1_REFNSEL                                      ADC_CFGR1_REFNSEL_Msk

#define    ADC_CFGR2_DMAEN_Pos                                    (0U)
#define    ADC_CFGR2_DMAEN_Msk                                    (0x1U << ADC_CFGR2_DMAEN_Pos)
#define    ADC_CFGR2_DMAEN                                        ADC_CFGR2_DMAEN_Msk

#define    ADC_CFGR2_SCANDIR_Pos                                  (2U)
#define    ADC_CFGR2_SCANDIR_Msk                                  (0x1U << ADC_CFGR2_SCANDIR_Pos)
#define    ADC_CFGR2_SCANDIR                                      ADC_CFGR2_SCANDIR_Msk

#define    ADC_CFGR2_EXTS_Pos                                     (4U)
#define    ADC_CFGR2_EXTS_Msk                                     (0xfU << ADC_CFGR2_EXTS_Pos)
#define    ADC_CFGR2_EXTS                                         ADC_CFGR2_EXTS_Msk

#define    ADC_CFGR2_OVRM_Pos                                     (8U)
#define    ADC_CFGR2_OVRM_Msk                                     (0x1U << ADC_CFGR2_OVRM_Pos)
#define    ADC_CFGR2_OVRM                                         ADC_CFGR2_OVRM_Msk

#define    ADC_CFGR2_CONT_Pos                                     (9U)
#define    ADC_CFGR2_CONT_Msk                                     (0x1U << ADC_CFGR2_CONT_Pos)
#define    ADC_CFGR2_CONT                                         ADC_CFGR2_CONT_Msk

#define    ADC_CFGR2_WAIT_Pos                                     (10U)
#define    ADC_CFGR2_WAIT_Msk                                     (0x1U << ADC_CFGR2_WAIT_Pos)
#define    ADC_CFGR2_WAIT                                         ADC_CFGR2_WAIT_Msk

#define    ADC_CFGR2_SEMI_Pos                                     (11U)
#define    ADC_CFGR2_SEMI_Msk                                     (0x1U << ADC_CFGR2_SEMI_Pos)
#define    ADC_CFGR2_SEMI                                         ADC_CFGR2_SEMI_Msk

#define    ADC_CFGR2_IOTRFEN_Pos                                  (14U)
#define    ADC_CFGR2_IOTRFEN_Msk                                  (0x1U << ADC_CFGR2_IOTRFEN_Pos)
#define    ADC_CFGR2_IOTRFEN                                      ADC_CFGR2_IOTRFEN_Msk

#define    ADC_CFGR2_OVSEN_Pos                                    (16U)
#define    ADC_CFGR2_OVSEN_Msk                                    (0x1U << ADC_CFGR2_OVSEN_Pos)
#define    ADC_CFGR2_OVSEN                                        ADC_CFGR2_OVSEN_Msk

#define    ADC_CFGR2_OVSR_Pos                                     (17U)
#define    ADC_CFGR2_OVSR_Msk                                     (0x7U << ADC_CFGR2_OVSR_Pos)
#define    ADC_CFGR2_OVSR                                         ADC_CFGR2_OVSR_Msk

#define    ADC_CFGR2_OVSS_Pos                                     (20U)
#define    ADC_CFGR2_OVSS_Msk                                     (0xfU << ADC_CFGR2_OVSS_Pos)
#define    ADC_CFGR2_OVSS                                         ADC_CFGR2_OVSS_Msk

