zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_adc.h
#define    ADC_CFGR2_AWDEN_Pos                                    (24U)
#define    ADC_CFGR2_AWDEN_Msk                                    (0x1U << ADC_CFGR2_AWDEN_Pos)
#define    ADC_CFGR2_AWDEN                                        ADC_CFGR2_AWDEN_Msk

#define    ADC_CFGR2_AWDSC_Pos                                    (25U)
#define    ADC_CFGR2_AWDSC_Msk                                    (0x1U << ADC_CFGR2_AWDSC_Pos)
#define    ADC_CFGR2_AWDSC                                        ADC_CFGR2_AWDSC_Msk

#define    ADC_CFGR2_AWDCH_Pos                                    (26U)
#define    ADC_CFGR2_AWDCH_Msk                                    (0x1fU << ADC_CFGR2_AWDCH_Pos)
#define    ADC_CFGR2_AWDCH                                        ADC_CFGR2_AWDCH_Msk

#define    ADC_SMTR_SMTS1_Pos                                     (0U)
#define    ADC_SMTR_SMTS1_Msk                                     (0xfU << ADC_SMTR_SMTS1_Pos)
#define    ADC_SMTR_SMTS1                                         ADC_SMTR_SMTS1_Msk

#define    ADC_SMTR_SMTS2_Pos                                     (4U)
#define    ADC_SMTR_SMTS2_Msk                                     (0xfU << ADC_SMTR_SMTS2_Pos)
#define    ADC_SMTR_SMTS2                                         ADC_SMTR_SMTS2_Msk

#define    ADC_DR_DATA_Pos                                        (0U)
#define    ADC_DR_DATA_Msk                                        (0xffffU << ADC_DR_DATA_Pos)
#define    ADC_DR_DATA                                            ADC_DR_DATA_Msk

#define    ADC_DR_CHID_Pos                                        (24U)
#define    ADC_DR_CHID_Msk                                        (0x3fU << ADC_DR_CHID_Pos)
#define    ADC_DR_CHID                                            ADC_DR_CHID_Msk

#define    ADC_HLTR_AWD_LT_Pos                                    (0U)
#define    ADC_HLTR_AWD_LT_Msk                                    (0xffffU << ADC_HLTR_AWD_LT_Pos)
#define    ADC_HLTR_AWD_LT                                        ADC_HLTR_AWD_LT_Msk

#define    ADC_HLTR_AWD_HT_Pos                                    (16U)
#define    ADC_HLTR_AWD_HT_Msk                                    (0xffffU << ADC_HLTR_AWD_HT_Pos)
#define    ADC_HLTR_AWD_HT                                        ADC_HLTR_AWD_HT_Msk

#define    ADC_JGCFGR_JEXTS_Pos                                   (0U)
#define    ADC_JGCFGR_JEXTS_Msk                                   (0xfU << ADC_JGCFGR_JEXTS_Pos)
#define    ADC_JGCFGR_JEXTS                                       ADC_JGCFGR_JEXTS_Msk

#define    ADC_JGCFGR_JMOD_Pos                                    (7U)
#define    ADC_JGCFGR_JMOD_Msk                                    (0x1U << ADC_JGCFGR_JMOD_Pos)
#define    ADC_JGCFGR_JMOD                                        ADC_JGCFGR_JMOD_Msk

#define    ADC_JGCFGR_JL_Pos                                      (8U)
#define    ADC_JGCFGR_JL_Msk                                      (0x7U << ADC_JGCFGR_JL_Pos)
#define    ADC_JGCFGR_JL                                          ADC_JGCFGR_JL_Msk

#define    ADC_JCFGR_JSEL0_Pos                                    (0U)
#define    ADC_JCFGR_JSEL0_Msk                                    (0xfU << ADC_JCFGR_JSEL0_Pos)
#define    ADC_JCFGR_JSEL0                                        ADC_JCFGR_JSEL0_Msk

#define    ADC_JCFGR_JSEL1_Pos                                    (4U)
#define    ADC_JCFGR_JSEL1_Msk                                    (0xfU << ADC_JCFGR_JSEL1_Pos)
#define    ADC_JCFGR_JSEL1                                        ADC_JCFGR_JSEL1_Msk

#define    ADC_JCFGR_JOVS0_Pos                                    (8U)
#define    ADC_JCFGR_JOVS0_Msk                                    (0x1U << ADC_JCFGR_JOVS0_Pos)
#define    ADC_JCFGR_JOVS0                                        ADC_JCFGR_JOVS0_Msk

#define    ADC_JCFGR_JOVSR0_Pos                                   (9U)
#define    ADC_JCFGR_JOVSR0_Msk                                   (0x3U << ADC_JCFGR_JOVSR0_Pos)
#define    ADC_JCFGR_JOVSR0                                       ADC_JCFGR_JOVSR0_Msk

#define    ADC_JCFGR_JSEL0_4_Pos                                  (11U)
#define    ADC_JCFGR_JSEL0_4_Msk                                  (0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    ADC_JCFGR_JSEL0_4                                      ADC_JCFGR_JSEL0_4_Msk

#define    ADC_JCFGR_JOVS1_Pos                                    (12U)
#define    ADC_JCFGR_JOVS1_Msk                                    (0x1U << ADC_JCFGR_JOVS1_Pos)
#define    ADC_JCFGR_JOVS1                                        ADC_JCFGR_JOVS1_Msk

#define    ADC_JCFGR_JOVSR1_Pos                                   (13U)
#define    ADC_JCFGR_JOVSR1_Msk                                   (0x3U << ADC_JCFGR_JOVSR1_Pos)
#define    ADC_JCFGR_JOVSR1                                       ADC_JCFGR_JOVSR1_Msk

#define    ADC_JCFGR_JSEL1_4_Pos                                  (15U)
#define    ADC_JCFGR_JSEL1_4_Msk                                  (0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    ADC_JCFGR_JSEL1_4                                      ADC_JCFGR_JSEL1_4_Msk

#define    ADC_JCFGR_JSEL2_Pos                                    (16U)
#define    ADC_JCFGR_JSEL2_Msk                                    (0xfU << ADC_JCFGR_JSEL2_Pos)
#define    ADC_JCFGR_JSEL2                                        ADC_JCFGR_JSEL2_Msk

#define    ADC_JCFGR_JSEL3_Pos                                    (20U)
#define    ADC_JCFGR_JSEL3_Msk                                    (0xfU << ADC_JCFGR_JSEL3_Pos)
#define    ADC_JCFGR_JSEL3                                        ADC_JCFGR_JSEL3_Msk

#define    ADC_JCFGR_JOVS2_Pos                                    (24U)
#define    ADC_JCFGR_JOVS2_Msk                                    (0x1U << ADC_JCFGR_JOVS2_Pos)
#define    ADC_JCFGR_JOVS2                                        ADC_JCFGR_JOVS2_Msk

#define    ADC_JCFGR_JOVSR2_Pos                                   (25U)
#define    ADC_JCFGR_JOVSR2_Msk                                   (0x3U << ADC_JCFGR_JOVSR2_Pos)
#define    ADC_JCFGR_JOVSR2                                       ADC_JCFGR_JOVSR2_Msk

#define    ADC_JCFGR_JSEL2_4_Pos                                  (27U)
#define    ADC_JCFGR_JSEL2_4_Msk                                  (0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    ADC_JCFGR_JSEL2_4                                      ADC_JCFGR_JSEL2_4_Msk

#define    ADC_JCFGR_JOVS3_Pos                                    (28U)
#define    ADC_JCFGR_JOVS3_Msk                                    (0x1U << ADC_JCFGR_JOVS3_Pos)
#define    ADC_JCFGR_JOVS3                                        ADC_JCFGR_JOVS3_Msk

#define    ADC_JCFGR_JOVSR3_Pos                                   (29U)
#define    ADC_JCFGR_JOVSR3_Msk                                   (0x3U << ADC_JCFGR_JOVSR3_Pos)
#define    ADC_JCFGR_JOVSR3                                       ADC_JCFGR_JOVSR3_Msk

#define    ADC_JCFGR_JSEL3_4_Pos                                  (31U)
#define    ADC_JCFGR_JSEL3_4_Msk                                  (0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    ADC_JCFGR_JSEL3_4                                      ADC_JCFGR_JSEL3_4_Msk

#define    ADC_JDR0_JDATA0_Pos                                    (0U)
#define    ADC_JDR0_JDATA0_Msk                                    (0xfffU << ADC_JDR0_JDATA0_Pos)
#define    ADC_JDR0_JDATA0                                        ADC_JDR0_JDATA0_Msk

#define    ADC_JDR1_JDATA1_Pos                                    (0U)
#define    ADC_JDR1_JDATA1_Msk                                    (0xfffU << ADC_JDR1_JDATA1_Pos)
#define    ADC_JDR1_JDATA1                                        ADC_JDR1_JDATA1_Msk

