zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_adc.h
#define    ADC_JDR2_JDATA2_Pos                                    (0U)
#define    ADC_JDR2_JDATA2_Msk                                    (0xfffU << ADC_JDR2_JDATA2_Pos)
#define    ADC_JDR2_JDATA2                                        ADC_JDR2_JDATA2_Msk

#define    ADC_JDR3_JDATA3_Pos                                    (0U)
#define    ADC_JDR3_JDATA3_Msk                                    (0xfffU << ADC_JDR3_JDATA3_Pos)
#define    ADC_JDR3_JDATA3                                        ADC_JDR3_JDATA3_Msk

#define    ADC_RAWR_RAWD_Pos                                      (0U)
#define    ADC_RAWR_RAWD_Msk                                      (0x1fffU << ADC_RAWR_RAWD_Pos)
#define    ADC_RAWR_RAWD                                          ADC_RAWR_RAWD_Msk



#define    FL_ADC_EXTERNAL_CH0                                    (0x1U << 0U)
#define    FL_ADC_EXTERNAL_CH1                                    (0x1U << 1U)
#define    FL_ADC_EXTERNAL_CH2                                    (0x1U << 2U)
#define    FL_ADC_EXTERNAL_CH3                                    (0x1U << 3U)
#define    FL_ADC_EXTERNAL_CH4                                    (0x1U << 4U)
#define    FL_ADC_EXTERNAL_CH5                                    (0x1U << 5U)
#define    FL_ADC_EXTERNAL_CH6                                    (0x1U << 6U)
#define    FL_ADC_EXTERNAL_CH7                                    (0x1U << 7U)
#define    FL_ADC_EXTERNAL_CH8                                    (0x1U << 8U)
#define    FL_ADC_EXTERNAL_CH9                                    (0x1U << 9U)
#define    FL_ADC_EXTERNAL_CH10                                   (0x1U << 10U)
#define    FL_ADC_EXTERNAL_CH11                                   (0x1U << 11U)
#define    FL_ADC_EXTERNAL_CH12                                   (0x1U << 12U)
#define    FL_ADC_EXTERNAL_CH13                                   (0x1U << 13U)
#define    FL_ADC_EXTERNAL_CH14                                   (0x1U << 14U)
#define    FL_ADC_EXTERNAL_CH15                                   (0x1U << 15U)
#define    FL_ADC_EXTERNAL_CH16                                   (0x1U << 16U)
#define    FL_ADC_EXTERNAL_CH17                                   (0x1U << 17U)
#define    FL_ADC_EXTERNAL_CH18                                   (0x1U << 18U)
#define    FL_ADC_EXTERNAL_CH19                                   (0x1U << 19U)
#define    FL_ADC_EXTERNAL_CH20                                   (0x1U << 20U)
#define    FL_ADC_EXTERNAL_CH21                                   (0x1U << 21U)
#define    FL_ADC_EXTERNAL_CH22                                   (0x1U << 22U)
#define    FL_ADC_EXTERNAL_CH23                                   (0x1U << 23U)
#define    FL_ADC_EXTERNAL_CH24                                   (0x1U << 24U)
#define    FL_ADC_EXTERNAL_CH25                                   (0x1U << 25U)
#define    FL_ADC_EXTERNAL_CH26                                   (0x1U << 26U)
#define    FL_ADC_EXTERNAL_CH27                                   (0x1U << 27U)
#define    FL_ADC_EXTERNAL_CH28                                   (0x1U << 28U)
#define    FL_ADC_EXTERNAL_CH29                                   (0x1U << 29U)
#define    FL_ADC_EXTERNAL_CH30                                   (0x1U << 30U)
#define    FL_ADC_INTERNAL_TS                                     (0x1U << 0U)
#define    FL_ADC_INTERNAL_AVREF                                  (0x1U << 1U)
#define    FL_ADC_INTERNAL_DAC                                    (0x1U << 2U)



#define    FL_ADC_RGTRIGGER_EDGE_NONE                             (0x0U << ADC_CR2_RTRGCFG_Pos)
#define    FL_ADC_RGTRIGGER_EDGE_RISING                           (0x1U << ADC_CR2_RTRGCFG_Pos)
#define    FL_ADC_RGTRIGGER_EDGE_FALLING                          (0x2U << ADC_CR2_RTRGCFG_Pos)
#define    FL_ADC_RGTRIGGER_EDGE_BOTH                             (0x3U << ADC_CR2_RTRGCFG_Pos)


#define    FL_ADC_JGTRIGGER_EDGE_NONE                             (0x0U << ADC_CR2_JTRGCFG_Pos)
#define    FL_ADC_JGTRIGGER_EDGE_RISING                           (0x1U << ADC_CR2_JTRGCFG_Pos)
#define    FL_ADC_JGTRIGGER_EDGE_FALLING                          (0x2U << ADC_CR2_JTRGCFG_Pos)
#define    FL_ADC_JGTRIGGER_EDGE_BOTH                             (0x3U << ADC_CR2_JTRGCFG_Pos)


#define    FL_ADC_CKDIG_DELAY_MIN                                 (0x0U << ADC_CALR_CKDIG_DELAY_Pos)
#define    FL_ADC_CKDIG_DELAY_MAX                                 (0x3U << ADC_CALR_CKDIG_DELAY_Pos)


#define    FL_ADC_CMP_MODE_Normal                                 (0x0U << ADC_CALR_CMP_MODE_Pos)
#define    FL_ADC_CMP_MODE_Fast                                   (0x1U << ADC_CALR_CMP_MODE_Pos)


#define    FL_ADC_CMP_DELAY_MIN                                   (0x0U << ADC_CALR_CMPRDY_DELAY_Pos)
#define    FL_ADC_CMP_DELAY_MAX                                   (0x3U << ADC_CALR_CMPRDY_DELAY_Pos)


#define    FL_ADC_VCM_MODE_NORMAL                                 (0x0U << ADC_CALR_VCM_MODE_Pos)
#define    FL_ADC_VCM_MODE_CONTINUOUS                             (0x1U << ADC_CALR_VCM_MODE_Pos)


#define    FL_ADC_CALIBRA_AUTO                                    (0x0U << ADC_CALR_OFFL_EN_Pos)
#define    FL_ADC_CALIBRA_OFFLINE                                 (0x1U << ADC_CALR_OFFL_EN_Pos)


#define    FL_ADC_REF_SOURCE_VDDA                                 (0x0U << ADC_CFGR1_PEFSEL_Pos)
#define    FL_ADC_REF_SOURCE_VREFP                                (0x1U << ADC_CFGR1_PEFSEL_Pos)


#define    FL_ADC_CLK_SOURCE_ADCCLK                               (0x0U << ADC_CFGR1_CLKSEL_Pos)
#define    FL_ADC_CLK_SOURCE_APBCLK                               (0x1U << ADC_CFGR1_CLKSEL_Pos)


#define    FL_ADC_BIT_WIDTH_12B                                   (0x0U << ADC_CFGR1_BITSEL_Pos)
#define    FL_ADC_BIT_WIDTH_10B                                   (0x1U << ADC_CFGR1_BITSEL_Pos)
#define    FL_ADC_BIT_WIDTH_8B                                    (0x2U << ADC_CFGR1_BITSEL_Pos)
#define    FL_ADC_BIT_WIDTH_6B                                    (0x3U << ADC_CFGR1_BITSEL_Pos)


#define    FL_ADC_APBCLK_PSC_DIV1                                 (0x0U << ADC_CFGR1_APBCLK_PSC_Pos)
#define    FL_ADC_APBCLK_PSC_DIV2                                 (0x1U << ADC_CFGR1_APBCLK_PSC_Pos)
#define    FL_ADC_APBCLK_PSC_DIV4                                 (0x2U << ADC_CFGR1_APBCLK_PSC_Pos)
#define    FL_ADC_APBCLK_PSC_DIV8                                 (0x3U << ADC_CFGR1_APBCLK_PSC_Pos)


