zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_adc.h
#define    FL_ADC_REF_NEGA_VSSA                                   (0x0U << ADC_CFGR1_REFNSEL_Pos)
#define    FL_ADC_REF_NEGA_VREFN                                  (0x1U << ADC_CFGR1_REFNSEL_Pos)


#define    FL_ADC_SEQ_SCAN_DIR_FORWARD                            (0x0U << ADC_CFGR2_SCANDIR_Pos)
#define    FL_ADC_SEQ_SCAN_DIR_BACKWARD                           (0x1U << ADC_CFGR2_SCANDIR_Pos)


#define    FL_ADC_TRGI_ATIM                                       (0x0U << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_TAU10                                      (0x1U << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_TAU11                                      (0x2U << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_TAU12                                      (0x3U << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_GPTIM1                                     (0x4U << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_GPTIM2                                     (0x5U << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_BSTIM16                                    (0x6U << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_LPTIM16                                    (0x7U << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_COMP1                                      (0x8U << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_COMP2                                      (0x9U << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_RTCA                                       (0xaU << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_TAU00                                      (0xbU << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_TAU01                                      (0xcU << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_TAU02                                      (0xdU << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_TAU03                                      (0xeU << ADC_CFGR2_EXTS_Pos)
#define    FL_ADC_TRGI_LUT0                                       (0xfU << ADC_CFGR2_EXTS_Pos)


#define    FL_ADC_CONV_MODE_SINGLE                                (0x0U << ADC_CFGR2_CONT_Pos)
#define    FL_ADC_CONV_MODE_CONTINUOUS                            (0x1U << ADC_CFGR2_CONT_Pos)


#define    FL_ADC_SINGLE_CONV_MODE_AUTO                           (0x0U << ADC_CFGR2_SEMI_Pos)
#define    FL_ADC_SINGLE_CONV_MODE_SEMIAUTO                       (0x1U << ADC_CFGR2_SEMI_Pos)


#define    FL_ADC_OVERSAMPLING_MUL_2X                             (0x0U << ADC_CFGR2_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_4X                             (0x1U << ADC_CFGR2_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_8X                             (0x2U << ADC_CFGR2_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_16X                            (0x3U << ADC_CFGR2_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_32X                            (0x4U << ADC_CFGR2_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_64X                            (0x5U << ADC_CFGR2_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_128X                           (0x6U << ADC_CFGR2_OVSR_Pos)
#define    FL_ADC_OVERSAMPLING_MUL_256X                           (0x7U << ADC_CFGR2_OVSR_Pos)


#define    FL_ADC_OVERSAMPLING_SHIFT_0B                           (0x0U << ADC_CFGR2_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_1B                           (0x1U << ADC_CFGR2_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_2B                           (0x2U << ADC_CFGR2_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_3B                           (0x3U << ADC_CFGR2_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_4B                           (0x4U << ADC_CFGR2_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_5B                           (0x5U << ADC_CFGR2_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_6B                           (0x6U << ADC_CFGR2_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_7B                           (0x7U << ADC_CFGR2_OVSS_Pos)
#define    FL_ADC_OVERSAMPLING_SHIFT_8B                           (0x8U << ADC_CFGR2_OVSS_Pos)


#define    FL_ADC_AWDG_ALL_CHANNEL                                (0x0U << ADC_CFGR2_AWDSC_Pos)
#define    FL_ADC_AWDG_SINGLE_CHANNEL                             (0x1U << ADC_CFGR2_AWDSC_Pos)


#define    FL_ADC_AWDG_CH0                                        (0x0U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH1                                        (0x1U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH2                                        (0x2U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH3                                        (0x3U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH4                                        (0x4U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH5                                        (0x5U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH6                                        (0x6U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH7                                        (0x7U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH8                                        (0x8U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH9                                        (0x9U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH10                                       (0xaU << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH11                                       (0xbU << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH12                                       (0xcU << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH13                                       (0xdU << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH14                                       (0xeU << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH15                                       (0xfU << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH16                                       (0x10U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH17                                       (0x11U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH18                                       (0x12U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH19                                       (0x13U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH20                                       (0x14U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH21                                       (0x15U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH22                                       (0x16U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH23                                       (0x17U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH24                                       (0x18U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH25                                       (0x19U << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH26                                       (0x1aU << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH27                                       (0x1bU << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH28                                       (0x1cU << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH29                                       (0x1dU << ADC_CFGR2_AWDCH_Pos)
#define    FL_ADC_AWDG_CH30                                       (0x1eU << ADC_CFGR2_AWDCH_Pos)


#define    FL_ADC_SLOW_CH_SAMPLING_TIME_2_ADCCLK                  (0x0U << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_4_ADCCLK                  (0x1U << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_8_ADCCLK                  (0x2U << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_12_ADCCLK                 (0x3U << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_16_ADCCLK                 (0x4U << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_32_ADCCLK                 (0x5U << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_64_ADCCLK                 (0x6U << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_80_ADCCLK                 (0x7U << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_96_ADCCLK                 (0x8U << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_128_ADCCLK                (0x9U << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_160_ADCCLK                (0xaU << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_192_ADCCLK                (0xbU << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_256_ADCCLK                (0xcU << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_320_ADCCLK                (0xdU << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_384_ADCCLK                (0xeU << ADC_SMTR_SMTS1_Pos)
#define    FL_ADC_SLOW_CH_SAMPLING_TIME_512_ADCCLK                (0xfU << ADC_SMTR_SMTS1_Pos)


#define    FL_ADC_FAST_CH_SAMPLING_TIME_2_ADCCLK                  (0x0U << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_4_ADCCLK                  (0x1U << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_8_ADCCLK                  (0x2U << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_12_ADCCLK                 (0x3U << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_16_ADCCLK                 (0x4U << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_32_ADCCLK                 (0x5U << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_64_ADCCLK                 (0x6U << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_80_ADCCLK                 (0x7U << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_96_ADCCLK                 (0x8U << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_128_ADCCLK                (0x9U << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_160_ADCCLK                (0xaU << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_192_ADCCLK                (0xbU << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_256_ADCCLK                (0xcU << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_320_ADCCLK                (0xdU << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_384_ADCCLK                (0xeU << ADC_SMTR_SMTS2_Pos)
#define    FL_ADC_FAST_CH_SAMPLING_TIME_512_ADCCLK                (0xfU << ADC_SMTR_SMTS2_Pos)


#define    FL_ADC_CONV_CHANNEL_CH0                                (0x0U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH1                                (0x1U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH2                                (0x2U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH3                                (0x3U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH4                                (0x4U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH5                                (0x5U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH6                                (0x6U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH7                                (0x7U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH8                                (0x8U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH9                                (0x9U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH10                               (0xaU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH11                               (0xbU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH12                               (0xcU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH13                               (0xdU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH14                               (0xeU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH15                               (0xfU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH16                               (0x10U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH17                               (0x11U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH18                               (0x12U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH19                               (0x13U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH20                               (0x14U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH21                               (0x15U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH22                               (0x16U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH23                               (0x17U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH24                               (0x18U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH25                               (0x19U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH26                               (0x1aU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH27                               (0x1bU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH28                               (0x1cU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH29                               (0x1dU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_CH30                               (0x1eU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_TS                                 (0x1fU << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_AVREF                              (0x20U << ADC_DR_CHID_Pos)
#define    FL_ADC_CONV_CHANNEL_DAC                                (0x21U << ADC_DR_CHID_Pos)

#define    FL_ADC_JG_EXTS_ATIM_TRGO                               (0x0U << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_TAU10_TRGO                              (0x1U << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_TAU11_TRGO                              (0x2U << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_TAU12_TRGO                              (0x3U << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_GPTIM1_TRGO                             (0x4U << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_GPTIM2_TRGO                             (0x5U << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_BSTIM16_TRGO                            (0x6U << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_LPTIM16_TRGO                            (0x7U << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_COMP1_TRGO                              (0x8U << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_COMP2_TRGO                              (0x9U << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_RTC_TRGO                                (0xaU << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_TAU00_TRGO                              (0xbU << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_TAU01_TRGO                              (0xcU << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_TAU02_TRGO                              (0xdU << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_TAU03_TRGO                              (0xeU << ADC_JGCFGR_JEXTS_Pos)
#define    FL_ADC_JG_EXTS_LUT0_TRGO                               (0xfU << ADC_JGCFGR_JEXTS_Pos)


#define    FL_ADC_JG_CONV_MODE_AUTO                               (0x0U << ADC_JGCFGR_JSEMI_Pos)
#define    FL_ADC_JG_CONV_MODE_SEMIAUTO                           (0x1U << ADC_JGCFGR_JSEMI_Pos)


#define    FL_ADC_JG_MODE_IMMEDIATE                               (0x0U << ADC_JGCFGR_JMOD_Pos)
#define    FL_ADC_JG_MODE_DELAYED                                 (0x1U << ADC_JGCFGR_JMOD_Pos)


#define    FL_ADC_JG_LENGTH_0L                                    (0x0U << ADC_JGCFGR_JL_Pos)
#define    FL_ADC_JG_LENGTH_1L                                    (0x1U << ADC_JGCFGR_JL_Pos)
#define    FL_ADC_JG_LENGTH_2L                                    (0x2U << ADC_JGCFGR_JL_Pos)
#define    FL_ADC_JG_LENGTH_3L                                    (0x3U << ADC_JGCFGR_JL_Pos)
#define    FL_ADC_JG_LENGTH_4L                                    (0x4U << ADC_JGCFGR_JL_Pos)


