zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_adc.h
#define    FL_ADC_JG_CHANNLE0_CH0                                 (0x0U << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH1                                 (0x1U << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH2                                 (0x2U << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH3                                 (0x3U << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH4                                 (0x4U << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH5                                 (0x5U << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH6                                 (0x6U << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH7                                 (0x7U << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH8                                 (0x8U << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH9                                 (0x9U << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH10                                (0xaU << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH11                                (0xbU << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH12                                (0xcU << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH13                                (0xdU << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH14                                (0xeU << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH15                                (0xfU << ADC_JCFGR_JSEL0_Pos)
#define    FL_ADC_JG_CHANNLE0_CH16                                (0x0U << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH17                                (0x1U << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH18                                (0x2U << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH19                                (0x3U << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH20                                (0x4U << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH21                                (0x5U << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH22                                (0x6U << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH23                                (0x7U << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH24                                (0x8U << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH25                                (0x9U << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH26                                (0xaU << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH27                                (0xbU << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH28                                (0xcU << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH29                                (0xdU << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)
#define    FL_ADC_JG_CHANNLE0_CH30                                (0xeU << ADC_JCFGR_JSEL0_Pos | 0x1U << ADC_JCFGR_JSEL0_4_Pos)


#define    FL_ADC_JG_CHANNLE1_CH0                                 (0x0U << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH1                                 (0x1U << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH2                                 (0x2U << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH3                                 (0x3U << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH4                                 (0x4U << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH5                                 (0x5U << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH6                                 (0x6U << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH7                                 (0x7U << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH8                                 (0x8U << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH9                                 (0x9U << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH10                                (0xaU << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH11                                (0xbU << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH12                                (0xcU << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH13                                (0xdU << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH14                                (0xeU << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH15                                (0xfU << ADC_JCFGR_JSEL1_Pos)
#define    FL_ADC_JG_CHANNLE1_CH16                                (0x0U << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH17                                (0x1U << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH18                                (0x2U << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH19                                (0x3U << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH20                                (0x4U << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH21                                (0x5U << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH22                                (0x6U << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH23                                (0x7U << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH24                                (0x8U << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH25                                (0x9U << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH26                                (0xaU << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH27                                (0xbU << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH28                                (0xcU << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH29                                (0xdU << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)
#define    FL_ADC_JG_CHANNLE1_CH30                                (0xeU << ADC_JCFGR_JSEL1_Pos | 0x1U << ADC_JCFGR_JSEL1_4_Pos)


#define    FL_ADC_JGCH0_OVERSAMPLING_MUL_2X                       (0x0U << ADC_JCFGR_JOVSR0_Pos)
#define    FL_ADC_JGCH0_OVERSAMPLING_MUL_4X                       (0x1U << ADC_JCFGR_JOVSR0_Pos)
#define    FL_ADC_JGCH0_OVERSAMPLING_MUL_8X                       (0x2U << ADC_JCFGR_JOVSR0_Pos)
#define    FL_ADC_JGCH0_OVERSAMPLING_MUL_16X                      (0x3U << ADC_JCFGR_JOVSR0_Pos)


#define    FL_ADC_JGCH1_OVERSAMPLING_MUL_2X                       (0x0U << ADC_JCFGR_JOVSR1_Pos)
#define    FL_ADC_JGCH1_OVERSAMPLING_MUL_4X                       (0x1U << ADC_JCFGR_JOVSR1_Pos)
#define    FL_ADC_JGCH1_OVERSAMPLING_MUL_8X                       (0x2U << ADC_JCFGR_JOVSR1_Pos)
#define    FL_ADC_JGCH1_OVERSAMPLING_MUL_16X                      (0x3U << ADC_JCFGR_JOVSR1_Pos)


#define    FL_ADC_JG_CHANNLE2_CH0                                 (0x0U << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH1                                 (0x1U << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH2                                 (0x2U << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH3                                 (0x3U << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH4                                 (0x4U << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH5                                 (0x5U << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH6                                 (0x6U << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH7                                 (0x7U << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH8                                 (0x8U << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH9                                 (0x9U << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH10                                (0xaU << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH11                                (0xbU << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH12                                (0xcU << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH13                                (0xdU << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH14                                (0xeU << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH15                                (0xfU << ADC_JCFGR_JSEL2_Pos)
#define    FL_ADC_JG_CHANNLE2_CH16                                (0x0U << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH17                                (0x1U << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH18                                (0x2U << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH19                                (0x3U << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH20                                (0x4U << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH21                                (0x5U << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH22                                (0x6U << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH23                                (0x7U << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH24                                (0x8U << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH25                                (0x9U << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH26                                (0xaU << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH27                                (0xbU << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH28                                (0xcU << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH29                                (0xdU << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)
#define    FL_ADC_JG_CHANNLE2_CH30                                (0xeU << ADC_JCFGR_JSEL2_Pos | 0x1U << ADC_JCFGR_JSEL2_4_Pos)


#define    FL_ADC_JG_CHANNLE3_CH0                                 (0x0U << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH1                                 (0x1U << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH2                                 (0x2U << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH3                                 (0x3U << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH4                                 (0x4U << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH5                                 (0x5U << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH6                                 (0x6U << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH7                                 (0x7U << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH8                                 (0x8U << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH9                                 (0x9U << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH10                                (0xaU << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH11                                (0xbU << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH12                                (0xcU << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH13                                (0xdU << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH14                                (0xeU << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH15                                (0xfU << ADC_JCFGR_JSEL3_Pos)
#define    FL_ADC_JG_CHANNLE3_CH16                                (0x0U << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH17                                (0x1U << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH18                                (0x2U << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH19                                (0x3U << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH20                                (0x4U << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH21                                (0x5U << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH22                                (0x6U << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH23                                (0x7U << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH24                                (0x8U << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH25                                (0x9U << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH26                                (0xaU << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH27                                (0xbU << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH28                                (0xcU << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH29                                (0xdU << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)
#define    FL_ADC_JG_CHANNLE3_CH30                                (0xeU << ADC_JCFGR_JSEL3_Pos | 0x1U << ADC_JCFGR_JSEL3_4_Pos)


#define    FL_ADC_JGCH2_OVERSAMPLING_MUL_2X                       (0x0U << ADC_JCFGR_JOVSR2_Pos)
#define    FL_ADC_JGCH2_OVERSAMPLING_MUL_4X                       (0x1U << ADC_JCFGR_JOVSR2_Pos)
#define    FL_ADC_JGCH2_OVERSAMPLING_MUL_8X                       (0x2U << ADC_JCFGR_JOVSR2_Pos)
#define    FL_ADC_JGCH2_OVERSAMPLING_MUL_16X                      (0x3U << ADC_JCFGR_JOVSR2_Pos)


#define    FL_ADC_JGCH3_OVERSAMPLING_MUL_2X                       (0x0U << ADC_JCFGR_JOVSR3_Pos)
#define    FL_ADC_JGCH3_OVERSAMPLING_MUL_4X                       (0x1U << ADC_JCFGR_JOVSR3_Pos)
#define    FL_ADC_JGCH3_OVERSAMPLING_MUL_8X                       (0x2U << ADC_JCFGR_JOVSR3_Pos)
#define    FL_ADC_JGCH3_OVERSAMPLING_MUL_16X                      (0x3U << ADC_JCFGR_JOVSR3_Pos)


/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup ADC_FL_Exported_Functions ADC Exported Functions
  * @{
  */

/**
  * @brief    Get ADC End Of Conversion Flag
  * @rmtoll   ISR    EOC    FL_ADC_IsActiveFlag_EndOfConversion
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_EndOfConversion(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_EOC_Msk) == (ADC_ISR_EOC_Msk));
}

/**
  * @brief    Clear ADC End Of Conversion Flag
  * @rmtoll   ISR    EOC    FL_ADC_ClearFlag_EndOfConversion
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_ClearFlag_EndOfConversion(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->ISR, ADC_ISR_EOC_Msk);
}

/**
  * @brief    Get ADC End Of Sequence Flag
  * @rmtoll   ISR    EOS    FL_ADC_IsActiveFlag_EndOfSequence
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_EndOfSequence(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_EOS_Msk) == (ADC_ISR_EOS_Msk));
}

/**
  * @brief    Clear ADC End Of Sequence Flag
  * @rmtoll   ISR    EOS    FL_ADC_ClearFlag_EndOfSequence
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_ClearFlag_EndOfSequence(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->ISR, ADC_ISR_EOS_Msk);
}

/**
  * @brief    Get ADC Data Overrun Flag
  * @rmtoll   ISR    OVR    FL_ADC_IsActiveFlag_Overrun
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_Overrun(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_OVR_Msk) == (ADC_ISR_OVR_Msk));
}

/**
  * @brief    Clear ADC  Data Overrun Flag
  * @rmtoll   ISR    OVR    FL_ADC_ClearFlag_Overrun
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_ClearFlag_Overrun(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->ISR, ADC_ISR_OVR_Msk);
}

/**
  * @brief    Get ADC Busy Flag
  * @rmtoll   ISR    BUSY    FL_ADC_IsActiveFlag_Busy
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_Busy(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_BUSY_Msk) == (ADC_ISR_BUSY_Msk));
}

/**
  * @brief    Get ADC End Of Calibration Flag
  * @rmtoll   ISR    EOCAL    FL_ADC_IsActiveFlag_EndOfCalibration
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_EndOfCalibration(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_EOCAL_Msk) == (ADC_ISR_EOCAL_Msk));
}

/**
  * @brief    Clear ADC End Of Calibration Flag
  * @rmtoll   ISR    EOCAL    FL_ADC_ClearFlag_EndOfCalibration
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_ClearFlag_EndOfCalibration(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->ISR, ADC_ISR_EOCAL_Msk);
}

/**
  * @brief    Get ADC Analog Watchdog Under Low
  * @rmtoll   ISR    AWD_UL    FL_ADC_IsActiveFlag_AnalogWDGUnderLow
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_AnalogWDGUnderLow(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_AWD_UL_Msk) == (ADC_ISR_AWD_UL_Msk));
}

/**
  * @brief    Clear ADC Analog Watchdog Under Low
  * @rmtoll   ISR    AWD_UL    FL_ADC_ClearFlag_AnalogWDGUnderLow
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_ClearFlag_AnalogWDGUnderLow(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->ISR, ADC_ISR_AWD_UL_Msk);
}

/**
  * @brief    Get ADC Analog Watchdog Above High
  * @rmtoll   ISR    AWD_AH    FL_ADC_IsActiveFlag_AnalogWDGAboveHigh
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_AnalogWDGAboveHigh(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ISR, ADC_ISR_AWD_AH_Msk) == (ADC_ISR_AWD_AH_Msk));
}

/**
  * @brief    Clear ADC Analog Watchdog Above High
  * @rmtoll   ISR    AWD_AH    FL_ADC_ClearFlag_AnalogWDGAboveHigh
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_ClearFlag_AnalogWDGAboveHigh(ADC_Type *ADCx)
{
    WRITE_REG(ADCx->ISR, ADC_ISR_AWD_AH_Msk);
}

/**
  * @brief    Enable ADC End 0f Conversion interrupt
  * @rmtoll   IER    EOCIE    FL_ADC_EnableIT_EndOfConversion
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableIT_EndOfConversion(ADC_Type *ADCx)
{
    SET_BIT(ADCx->IER, ADC_IER_EOCIE_Msk);
}

/**
  * @brief    Disable ADC End 0f Conversion interrupt
  * @rmtoll   IER    EOCIE    FL_ADC_DisableIT_EndOfConversion
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableIT_EndOfConversion(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->IER, ADC_IER_EOCIE_Msk);
}

/**
  * @brief    Get ADC End 0f Conversion interrupt Enable Status
  * @rmtoll   IER    EOCIE    FL_ADC_IsEnabledIT_EndOfConversion
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledIT_EndOfConversion(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->IER, ADC_IER_EOCIE_Msk) == ADC_IER_EOCIE_Msk);
}

/**
  * @brief    Enable ADC End Of Sequence interrupt
  * @rmtoll   IER    EOSIE    FL_ADC_EnableIT_EndOfSequence
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableIT_EndOfSequence(ADC_Type *ADCx)
{
    SET_BIT(ADCx->IER, ADC_IER_EOSIE_Msk);
}

/**
  * @brief    Disable ADC End Of Sequence interrupt
  * @rmtoll   IER    EOSIE    FL_ADC_DisableIT_EndOfSequence
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableIT_EndOfSequence(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->IER, ADC_IER_EOSIE_Msk);
}

/**
  * @brief    Get ADC End Of Sequence interrupt Enable Status
  * @rmtoll   IER    EOSIE    FL_ADC_IsEnabledIT_EndOfSequence
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledIT_EndOfSequence(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->IER, ADC_IER_EOSIE_Msk) == ADC_IER_EOSIE_Msk);
}

/**
  * @brief    Enable ADC Data Overrun interrupt
  * @rmtoll   IER    OVRIE    FL_ADC_EnableIT_Overrun
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableIT_Overrun(ADC_Type *ADCx)
{
    SET_BIT(ADCx->IER, ADC_IER_OVRIE_Msk);
}

/**
  * @brief    Disable ADC Data Overrun interrupt
  * @rmtoll   IER    OVRIE    FL_ADC_DisableIT_Overrun
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableIT_Overrun(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->IER, ADC_IER_OVRIE_Msk);
}

/**
  * @brief    Get ADC Data Overrun interrupt Enable Status
  * @rmtoll   IER    OVRIE    FL_ADC_IsEnabledIT_Overrun
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledIT_Overrun(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->IER, ADC_IER_OVRIE_Msk) == ADC_IER_OVRIE_Msk);
}

/**
  * @brief    Enable ADC End Of Calibration interrupt
  * @rmtoll   IER    EOCALIE    FL_ADC_EnableIT_EndOfCalibration
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableIT_EndOfCalibration(ADC_Type *ADCx)
{
    SET_BIT(ADCx->IER, ADC_IER_EOCALIE_Msk);
}

/**
  * @brief    Disable ADC End Of Calibration interrupt
  * @rmtoll   IER    EOCALIE    FL_ADC_DisableIT_EndOfCalibration
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableIT_EndOfCalibration(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->IER, ADC_IER_EOCALIE_Msk);
}

/**
  * @brief    Get ADC End Of Calibration interrupt Enable Status
  * @rmtoll   IER    EOCALIE    FL_ADC_IsEnabledIT_EndOfCalibration
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledIT_EndOfCalibration(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->IER, ADC_IER_EOCALIE_Msk) == ADC_IER_EOCALIE_Msk);
}

/**
  * @brief    Enable ADC Analog Watchdog Under Low interrupt
  * @rmtoll   IER    AWD_ULIE    FL_ADC_EnableIT_AnalogWDGUnderLow
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableIT_AnalogWDGUnderLow(ADC_Type *ADCx)
{
    SET_BIT(ADCx->IER, ADC_IER_AWD_ULIE_Msk);
}

