zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_adc.h
/**
  * @brief    Get ADC Conversion Channel
  * @rmtoll   DR    CHID    FL_ADC_GetConversionChannel
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH0
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH1
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH2
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH3
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH4
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH5
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH6
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH7
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH8
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH9
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH10
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH11
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH12
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH13
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH14
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH15
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH16
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH17
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH18
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH19
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH20
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH21
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH22
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH23
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH24
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH25
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH26
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH27
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH28
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH29
  *           @arg @ref FL_ADC_CONV_CHANNEL_CH30
  *           @arg @ref FL_ADC_CONV_CHANNEL_TS
  *           @arg @ref FL_ADC_CONV_CHANNEL_AVREF
  *           @arg @ref FL_ADC_CONV_CHANNEL_DAC
  */
__STATIC_INLINE uint32_t FL_ADC_GetConversionChannel(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->DR, ADC_DR_CHID_Msk));
}

/**
  * @brief    Write ADC Analog Watchdog Under Low
  * @rmtoll   HLTR    AWD_LT    FL_ADC_WriteAnalogWDGLowThreshold
  * @param    ADCx ADC instance
  * @param    threshold 
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_WriteAnalogWDGLowThreshold(ADC_Type *ADCx, uint32_t threshold)
{
    MODIFY_REG(ADCx->HLTR, (0xffffU << 0U), (threshold << 0U));
}

/**
  * @brief    Read ADC Analog Watchdog Under Low
  * @rmtoll   HLTR    AWD_LT    FL_ADC_ReadAnalogWDGLowThreshold
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadAnalogWDGLowThreshold(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->HLTR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Write ADC Analog Watchdog Above High
  * @rmtoll   HLTR    AWD_HT    FL_ADC_WriteAnalogWDGHighThreshold
  * @param    ADCx ADC instance
  * @param    threshold 
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_WriteAnalogWDGHighThreshold(ADC_Type *ADCx, uint32_t threshold)
{
    MODIFY_REG(ADCx->HLTR, (0xffffU << 16U), (threshold << 16U));
}

/**
  * @brief    Read ADC Analog Watchdog Above High
  * @rmtoll   HLTR    AWD_HT    FL_ADC_ReadAnalogWDGHighThreshold
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadAnalogWDGHighThreshold(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->HLTR, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Set ADC Injection Group External Trriger Source
  * @rmtoll   JGCFGR    JEXTS    FL_ADC_SetInjectionGroupExternalTrigerSouce
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_JG_EXTS_ATIM_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU10_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU11_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU12_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_GPTIM1_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_GPTIM2_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_BSTIM16_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_LPTIM16_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_COMP1_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_COMP2_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_RTC_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU00_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU01_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU02_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU03_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_LUT0_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionGroupExternalTrigerSouce(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->JGCFGR, ADC_JGCFGR_JEXTS_Msk, source);
}

/**
  * @brief    Get ADC Injection Group External Trriger Source
  * @rmtoll   JGCFGR    JEXTS    FL_ADC_GetInjectionGroupExternalTrigerSouce
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_JG_EXTS_ATIM_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU10_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU11_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU12_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_GPTIM1_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_GPTIM2_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_BSTIM16_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_LPTIM16_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_COMP1_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_COMP2_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_RTC_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU00_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU01_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU02_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_TAU03_TRGO
  *           @arg @ref FL_ADC_JG_EXTS_LUT0_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionGroupExternalTrigerSouce(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JGCFGR, ADC_JGCFGR_JEXTS_Msk));
}

/**
  * @brief    Set ADC Injection Mode
  * @rmtoll   JGCFGR    JMOD    FL_ADC_SetInjectionMode
  * @param    ADCx ADC instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_ADC_JG_MODE_IMMEDIATE
  *           @arg @ref FL_ADC_JG_MODE_DELAYED
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionMode(ADC_Type *ADCx, uint32_t mode)
{
    MODIFY_REG(ADCx->JGCFGR, ADC_JGCFGR_JMOD_Msk, mode);
}

/**
  * @brief    Get ADC Injection Mode
  * @rmtoll   JGCFGR    JMOD    FL_ADC_GetInjectionMode
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_JG_MODE_IMMEDIATE
  *           @arg @ref FL_ADC_JG_MODE_DELAYED
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionMode(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JGCFGR, ADC_JGCFGR_JMOD_Msk));
}

/**
  * @brief    Set ADC Injection Group Conversion Length
  * @rmtoll   JGCFGR    JL    FL_ADC_SetInjectionGroupConversionLength
  * @param    ADCx ADC instance
  * @param    length This parameter can be one of the following values:
  *           @arg @ref FL_ADC_JG_LENGTH_0L
  *           @arg @ref FL_ADC_JG_LENGTH_1L
  *           @arg @ref FL_ADC_JG_LENGTH_2L
  *           @arg @ref FL_ADC_JG_LENGTH_3L
  *           @arg @ref FL_ADC_JG_LENGTH_4L
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionGroupConversionLength(ADC_Type *ADCx, uint32_t length)
{
    MODIFY_REG(ADCx->JGCFGR, ADC_JGCFGR_JL_Msk, length);
}

/**
  * @brief    Get ADC Injection Group Conversion Length
  * @rmtoll   JGCFGR    JL    FL_ADC_GetInjectionGroupConversionLength
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_JG_LENGTH_0L
  *           @arg @ref FL_ADC_JG_LENGTH_1L
  *           @arg @ref FL_ADC_JG_LENGTH_2L
  *           @arg @ref FL_ADC_JG_LENGTH_3L
  *           @arg @ref FL_ADC_JG_LENGTH_4L
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionGroupConversionLength(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JGCFGR, ADC_JGCFGR_JL_Msk));
}

/**
  * @brief    Set ADC Injection Group Channel0
  * @rmtoll   JCFGR    JSEL0    FL_ADC_SetInjectionGroupChannel0
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH0
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH1
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH2
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH3
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH4
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH5
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH6
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH7
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH8
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH9
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH10
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH11
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH12
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH13
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH14
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH15
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH16
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH17
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH18
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH19
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH20
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH21
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH22
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH23
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH24
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH25
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH26
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH27
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH28
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH29
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH30
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionGroupChannel0(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->JCFGR, (ADC_JCFGR_JSEL0_Msk | ADC_JCFGR_JSEL0_4_Msk), channel);
}

/**
  * @brief    Get ADC Injection Group Channel0
  * @rmtoll   JCFGR    JSEL0    FL_ADC_GetInjectionGroupChannel0
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH0
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH1
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH2
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH3
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH4
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH5
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH6
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH7
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH8
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH9
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH10
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH11
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH12
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH13
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH14
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH15
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH16
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH17
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH18
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH19
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH20
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH21
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH22
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH23
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH24
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH25
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH26
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH27
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH28
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH29
  *           @arg @ref FL_ADC_JG_CHANNLE0_CH30
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionGroupChannel0(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, (ADC_JCFGR_JSEL0_Msk | ADC_JCFGR_JSEL0_4_Msk)));
}

/**
  * @brief    Set ADC Injection Group
Channel1
  * @rmtoll   JCFGR    JSEL1    FL_ADC_SetInjectionGroupChannel1
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH0
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH1
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH2
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH3
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH4
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH5
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH6
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH7
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH8
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH9
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH10
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH11
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH12
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH13
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH14
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH15
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH16
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH17
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH18
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH19
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH20
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH21
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH22
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH23
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH24
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH25
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH26
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH27
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH28
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH29
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH30
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionGroupChannel1(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->JCFGR, (ADC_JCFGR_JSEL1_Msk | ADC_JCFGR_JSEL1_4_Msk), channel);
}

/**
  * @brief    Get ADC Injection Group Channel1
  * @rmtoll   JCFGR    JSEL1    FL_ADC_GetInjectionGroupChannel1
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH0
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH1
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH2
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH3
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH4
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH5
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH6
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH7
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH8
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH9
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH10
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH11
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH12
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH13
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH14
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH15
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH16
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH17
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH18
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH19
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH20
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH21
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH22
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH23
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH24
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH25
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH26
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH27
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH28
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH29
  *           @arg @ref FL_ADC_JG_CHANNLE1_CH30
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionGroupChannel1(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, (ADC_JCFGR_JSEL1_Msk | ADC_JCFGR_JSEL1_4_Msk)));
}

/**
  * @brief    Enable ADC Injection Group Channel0 OverSampling
  * @rmtoll   JCFGR    JOVS0    FL_ADC_EnableInjectionGroupChannel0Oversampling
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableInjectionGroupChannel0Oversampling(ADC_Type *ADCx)
{
    SET_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS0_Msk);
}

/**
  * @brief    Disable ADC Injection Group Channel0 OverSampling
  * @rmtoll   JCFGR    JOVS0    FL_ADC_DisableInjectionGroupChannel0Oversampling
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableInjectionGroupChannel0Oversampling(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS0_Msk);
}

/**
  * @brief    Get ADC Injection Group Channel0 OverSampling Enable Status
  * @rmtoll   JCFGR    JOVS0    FL_ADC_IsEnabledInjectionGroupChannel0Oversampling
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledInjectionGroupChannel0Oversampling(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS0_Msk) == ADC_JCFGR_JOVS0_Msk);
}

/**
  * @brief    Set ADC Injection Group Channel0 OverSampling Multiplier
  * @rmtoll   JCFGR    JOVSR0    FL_ADC_SetInjectionGroupChannel0OversamplingMultiplier
  * @param    ADCx ADC instance
  * @param    mul This parameter can be one of the following values:
  *           @arg @ref FL_ADC_JGCH0_OVERSAMPLING_MUL_2X
  *           @arg @ref FL_ADC_JGCH0_OVERSAMPLING_MUL_4X
  *           @arg @ref FL_ADC_JGCH0_OVERSAMPLING_MUL_8X
  *           @arg @ref FL_ADC_JGCH0_OVERSAMPLING_MUL_16X
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionGroupChannel0OversamplingMultiplier(ADC_Type *ADCx, uint32_t mul)
{
    MODIFY_REG(ADCx->JCFGR, ADC_JCFGR_JOVSR0_Msk, mul);
}

/**
  * @brief    Get ADC Injection Group Channel0 OverSampling Multiplier
  * @rmtoll   JCFGR    JOVSR0    FL_ADC_GetInjectionGroupChannel0OversamplingMultiplier
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_JGCH0_OVERSAMPLING_MUL_2X
  *           @arg @ref FL_ADC_JGCH0_OVERSAMPLING_MUL_4X
  *           @arg @ref FL_ADC_JGCH0_OVERSAMPLING_MUL_8X
  *           @arg @ref FL_ADC_JGCH0_OVERSAMPLING_MUL_16X
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionGroupChannel0OversamplingMultiplier(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, ADC_JCFGR_JOVSR0_Msk));
}

/**
  * @brief    Enable ADC Injection Group Channel1 OverSampling
  * @rmtoll   JCFGR    JOVS1    FL_ADC_EnableInjectionGroupChannel1Oversampling
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableInjectionGroupChannel1Oversampling(ADC_Type *ADCx)
{
    SET_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS1_Msk);
}

/**
  * @brief    Disable ADC Injection Group Channel1 OverSampling
  * @rmtoll   JCFGR    JOVS1    FL_ADC_DisableInjectionGroupChannel1Oversampling
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableInjectionGroupChannel1Oversampling(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS1_Msk);
}

/**
  * @brief    Get ADC Injection Group Channel1 OverSampling Enable Status
  * @rmtoll   JCFGR    JOVS1    FL_ADC_IsEnabledInjectionGroupChannel1Oversampling
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledInjectionGroupChannel1Oversampling(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS1_Msk) == ADC_JCFGR_JOVS1_Msk);
}

/**
  * @brief    Set ADC Injection Group Channel1 OverSampling Multiplier
  * @rmtoll   JCFGR    JOVSR1    FL_ADC_SetInjectionGroupChannel1OversamplingMultiplier
  * @param    ADCx ADC instance
  * @param    mul This parameter can be one of the following values:
  *           @arg @ref FL_ADC_JGCH1_OVERSAMPLING_MUL_2X
  *           @arg @ref FL_ADC_JGCH1_OVERSAMPLING_MUL_4X
  *           @arg @ref FL_ADC_JGCH1_OVERSAMPLING_MUL_8X
  *           @arg @ref FL_ADC_JGCH1_OVERSAMPLING_MUL_16X
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionGroupChannel1OversamplingMultiplier(ADC_Type *ADCx, uint32_t mul)
{
    MODIFY_REG(ADCx->JCFGR, ADC_JCFGR_JOVSR1_Msk, mul);
}

/**
  * @brief    Get ADC Injection Group Channel1 OverSampling Multiplier
  * @rmtoll   JCFGR    JOVSR1    FL_ADC_GetInjectionGroupChannel1OversamplingMultiplier
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_JGCH1_OVERSAMPLING_MUL_2X
  *           @arg @ref FL_ADC_JGCH1_OVERSAMPLING_MUL_4X
  *           @arg @ref FL_ADC_JGCH1_OVERSAMPLING_MUL_8X
  *           @arg @ref FL_ADC_JGCH1_OVERSAMPLING_MUL_16X
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionGroupChannel1OversamplingMultiplier(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, ADC_JCFGR_JOVSR1_Msk));
}

/**
  * @brief    Set ADC Injection Group
Channel2
  * @rmtoll   JCFGR    JSEL2    FL_ADC_SetInjectionGroupChannel2
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH0
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH1
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH2
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH3
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH4
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH5
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH6
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH7
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH8
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH9
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH10
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH11
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH12
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH13
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH14
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH15
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH16
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH17
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH18
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH19
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH20
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH21
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH22
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH23
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH24
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH25
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH26
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH27
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH28
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH29
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH30
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionGroupChannel2(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->JCFGR, (ADC_JCFGR_JSEL2_Msk | ADC_JCFGR_JSEL2_4_Msk), channel);
}

