zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_adc.h
/**
  * @brief    Get ADC Injection Group
Channel2
  * @rmtoll   JCFGR    JSEL2    FL_ADC_GetInjectionGroupChannel2
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH0
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH1
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH2
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH3
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH4
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH5
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH6
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH7
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH8
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH9
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH10
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH11
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH12
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH13
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH14
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH15
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH16
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH17
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH18
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH19
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH20
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH21
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH22
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH23
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH24
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH25
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH26
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH27
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH28
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH29
  *           @arg @ref FL_ADC_JG_CHANNLE2_CH30
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionGroupChannel2(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, (ADC_JCFGR_JSEL2_Msk | ADC_JCFGR_JSEL2_4_Msk)));
}

/**
  * @brief    Set ADC Injection Group
Channel3
  * @rmtoll   JCFGR    JSEL25    FL_ADC_SetInjectionGroupChannel3
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH0
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH1
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH2
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH3
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH4
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH5
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH6
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH7
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH8
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH9
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH10
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH11
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH12
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH13
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH14
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH15
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH16
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH17
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH18
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH19
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH20
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH21
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH22
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH23
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH24
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH25
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH26
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH27
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH28
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH29
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH30
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionGroupChannel3(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->JCFGR, (ADC_JCFGR_JSEL3_Msk | ADC_JCFGR_JSEL3_4_Msk), channel);
}

/**
  * @brief    Get ADC Injection Group
Channel3
  * @rmtoll   JCFGR    JSEL25    FL_ADC_GetInjectionGroupChannel3
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH0
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH1
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH2
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH3
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH4
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH5
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH6
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH7
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH8
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH9
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH10
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH11
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH12
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH13
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH14
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH15
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH16
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH17
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH18
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH19
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH20
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH21
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH22
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH23
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH24
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH25
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH26
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH27
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH28
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH29
  *           @arg @ref FL_ADC_JG_CHANNLE3_CH30
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionGroupChannel3(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, (ADC_JCFGR_JSEL3_Msk | ADC_JCFGR_JSEL3_4_Msk)));
}

/**
  * @brief    Enable ADC Injection Group Channel2 OverSampling
  * @rmtoll   JCFGR    JOVS2    FL_ADC_EnableInjectionGroupChannel2Oversampling
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableInjectionGroupChannel2Oversampling(ADC_Type *ADCx)
{
    SET_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS2_Msk);
}

/**
  * @brief    Disable ADC Injection Group Channel2 OverSampling
  * @rmtoll   JCFGR    JOVS2    FL_ADC_DisableInjectionGroupChannel2Oversampling
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableInjectionGroupChannel2Oversampling(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS2_Msk);
}

/**
  * @brief    Get ADC Injection Group Channel2 OverSampling Enable Status
  * @rmtoll   JCFGR    JOVS2    FL_ADC_IsEnabledInjectionGroupChannel2Oversampling
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledInjectionGroupChannel2Oversampling(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS2_Msk) == ADC_JCFGR_JOVS2_Msk);
}

/**
  * @brief    Set ADC Injection Group Channel2 OverSampling Multiplier
  * @rmtoll   JCFGR    JOVSR2    FL_ADC_SetInjectionGroupChannel2OversamplingMultiplier
  * @param    ADCx ADC instance
  * @param    mul This parameter can be one of the following values:
  *           @arg @ref FL_ADC_JGCH2_OVERSAMPLING_MUL_2X
  *           @arg @ref FL_ADC_JGCH2_OVERSAMPLING_MUL_4X
  *           @arg @ref FL_ADC_JGCH2_OVERSAMPLING_MUL_8X
  *           @arg @ref FL_ADC_JGCH2_OVERSAMPLING_MUL_16X
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionGroupChannel2OversamplingMultiplier(ADC_Type *ADCx, uint32_t mul)
{
    MODIFY_REG(ADCx->JCFGR, ADC_JCFGR_JOVSR2_Msk, mul);
}

/**
  * @brief    Get ADC Injection Group Channel2 OverSampling Multiplier
  * @rmtoll   JCFGR    JOVSR2    FL_ADC_GetInjectionGroupChannel2OversamplingMultiplier
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_JGCH2_OVERSAMPLING_MUL_2X
  *           @arg @ref FL_ADC_JGCH2_OVERSAMPLING_MUL_4X
  *           @arg @ref FL_ADC_JGCH2_OVERSAMPLING_MUL_8X
  *           @arg @ref FL_ADC_JGCH2_OVERSAMPLING_MUL_16X
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionGroupChannel2OversamplingMultiplier(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, ADC_JCFGR_JOVSR2_Msk));
}

/**
  * @brief    Enable ADC Injection Group Channel3 OverSampling
  * @rmtoll   JCFGR    JOVS3    FL_ADC_EnableInjectionGroupChannel3Oversampling
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_EnableInjectionGroupChannel3Oversampling(ADC_Type *ADCx)
{
    SET_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS3_Msk);
}

/**
  * @brief    Disable ADC Injection Group Channel3 OverSampling
  * @rmtoll   JCFGR    JOVS3    FL_ADC_DisableInjectionGroupChannel3Oversampling
  * @param    ADCx ADC instance
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_DisableInjectionGroupChannel3Oversampling(ADC_Type *ADCx)
{
    CLEAR_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS3_Msk);
}

/**
  * @brief    Get ADC Injection Group Channel3 OverSampling Enable Status
  * @rmtoll   JCFGR    JOVS3    FL_ADC_IsEnabledInjectionGroupChannel3Oversampling
  * @param    ADCx ADC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsEnabledInjectionGroupChannel3Oversampling(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, ADC_JCFGR_JOVS3_Msk) == ADC_JCFGR_JOVS3_Msk);
}

/**
  * @brief    Set ADC Injection Group Channel3 OverSampling Multiplier
  * @rmtoll   JCFGR    JOVSR3    FL_ADC_SetInjectionGroupChannel3OversamplingMultiplier
  * @param    ADCx ADC instance
  * @param    mul This parameter can be one of the following values:
  *           @arg @ref FL_ADC_JGCH3_OVERSAMPLING_MUL_2X
  *           @arg @ref FL_ADC_JGCH3_OVERSAMPLING_MUL_4X
  *           @arg @ref FL_ADC_JGCH3_OVERSAMPLING_MUL_8X
  *           @arg @ref FL_ADC_JGCH3_OVERSAMPLING_MUL_16X
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetInjectionGroupChannel3OversamplingMultiplier(ADC_Type *ADCx, uint32_t mul)
{
    MODIFY_REG(ADCx->JCFGR, ADC_JCFGR_JOVSR3_Msk, mul);
}

/**
  * @brief    Get ADC Injection Group Channel3 OverSampling Multiplier
  * @rmtoll   JCFGR    JOVSR3    FL_ADC_GetInjectionGroupChannel3OversamplingMultiplier
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_JGCH3_OVERSAMPLING_MUL_2X
  *           @arg @ref FL_ADC_JGCH3_OVERSAMPLING_MUL_4X
  *           @arg @ref FL_ADC_JGCH3_OVERSAMPLING_MUL_8X
  *           @arg @ref FL_ADC_JGCH3_OVERSAMPLING_MUL_16X
  */
__STATIC_INLINE uint32_t FL_ADC_GetInjectionGroupChannel3OversamplingMultiplier(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JCFGR, ADC_JCFGR_JOVSR3_Msk));
}

/**
  * @brief    Set ADC Injection Group Channel0 Conversion Data
  * @rmtoll   JDR0    JDATA0    FL_ADC_WriteInjectionGroupChannel0ConversionData
  * @param    ADCx ADC instance
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_WriteInjectionGroupChannel0ConversionData(ADC_Type *ADCx, uint32_t data)
{
    MODIFY_REG(ADCx->JDR0, ADC_JDR0_JDATA0_Msk, (data << ADC_JDR0_JDATA0_Pos));
}

/**
  * @brief    Get ADC Injection Group Channel0 Conversion Data
  * @rmtoll   JDR0    JDATA0    FL_ADC_ReadInjectionGroupChannel0ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadInjectionGroupChannel0ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JDR0, ADC_JDR0_JDATA0_Msk) >> ADC_JDR0_JDATA0_Pos);
}

/**
  * @brief    Set ADC Injection Group Channel1 Conversion Data
  * @rmtoll   JDR1    JDATA1    FL_ADC_WriteInjectionGroupChannel1ConversionData
  * @param    ADCx ADC instance
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_WriteInjectionGroupChannel1ConversionData(ADC_Type *ADCx, uint32_t data)
{
    MODIFY_REG(ADCx->JDR1, ADC_JDR1_JDATA1_Msk, (data << ADC_JDR1_JDATA1_Pos));
}

/**
  * @brief    Get ADC Injection Group Channel1 Conversion Data
  * @rmtoll   JDR1    JDATA1    FL_ADC_ReadInjectionGroupChannel1ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadInjectionGroupChannel1ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JDR1, ADC_JDR1_JDATA1_Msk) >> ADC_JDR1_JDATA1_Pos);
}

/**
  * @brief    Set ADC Injection Group Channel2 Conversion Data
  * @rmtoll   JDR2    JDATA2    FL_ADC_WriteInjectionGroupChannel2ConversionData
  * @param    ADCx ADC instance
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_WriteInjectionGroupChannel2ConversionData(ADC_Type *ADCx, uint32_t data)
{
    MODIFY_REG(ADCx->JDR2, ADC_JDR2_JDATA2_Msk, (data << ADC_JDR2_JDATA2_Pos));
}

/**
  * @brief    Get ADC Injection Group Channel2 Conversion Data
  * @rmtoll   JDR2    JDATA2    FL_ADC_ReadInjectionGroupChannel2ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadInjectionGroupChannel2ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JDR2, ADC_JDR2_JDATA2_Msk) >> ADC_JDR2_JDATA2_Pos);
}

/**
  * @brief    Set ADC Injection Group Channel3 Conversion Data
  * @rmtoll   JDR3    JDATA3    FL_ADC_WriteInjectionGroupChannel3ConversionData
  * @param    ADCx ADC instance
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_WriteInjectionGroupChannel3ConversionData(ADC_Type *ADCx, uint32_t data)
{
    MODIFY_REG(ADCx->JDR3, ADC_JDR3_JDATA3_Msk, (data << ADC_JDR3_JDATA3_Pos));
}

/**
  * @brief    Get ADC Injection Group Channel3 Conversion Data
  * @rmtoll   JDR3    JDATA3    FL_ADC_ReadInjectionGroupChannel3ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadInjectionGroupChannel3ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->JDR3, ADC_JDR3_JDATA3_Msk) >> ADC_JDR3_JDATA3_Pos);
}

/**
  * @brief    Get ADC Raw Data
  * @rmtoll   RAWR    RAWD    FL_ADC_ReadRawData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadRawData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->RAWR, ADC_RAWR_RAWD_Msk) >> ADC_RAWR_RAWD_Pos);
}

/**
  * @}
  */

/** @defgroup ADC_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
extern FL_ErrorStatus FL_ADC_CommonDeInit(void);
extern FL_ErrorStatus FL_ADC_DeInit(ADC_Type *ADCx);
extern FL_ErrorStatus FL_ADC_CommonInit(FL_ADC_CommonInitTypeDef *ADC_CommonInitStruct);
extern FL_ErrorStatus FL_ADC_Init(ADC_Type *ADCx, FL_ADC_InitTypeDef  *ADC_InitStruct);
extern void FL_ADC_StructInit(FL_ADC_InitTypeDef *ADC_InitStruct);
extern void FL_ADC_CommonStructInit(FL_ADC_CommonInitTypeDef *ADC_CommonInitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FG0XX_FL_ADC_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-03-24*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
